package com.epiboly.bea2;

public interface PrivacyInfo {

    String PRIVACY_INFO = "" +
            "欢迎使用 BEA 应用！BEA应用是由五河县乞灵广告中心（个体工商户）开发的管理系统工具。本隐私协议将帮助您了解我们如何收集、使用、存储和共享您的个人信息，以保障您的隐私权益。请仔细阅读本隐私协议，在使用本应用前，若您对本协议有任何疑问，请联系我们。\n" +
            "一、信息收集\n" +
            "设备信息：当您使用本应用时，我们会收集您的设备信息（包括IMEI、设备序列号、OAID、MEID、Android ID、IMSI、MAC地址、SIM卡序列号）、已安装app信息。以确保应用的正常运行和安全性。\n" +
            "使用信息：我们会记录您使用应用的相关信息，如访问时间、使用频率、浏览内容等，以优化应用功能和服务。\n" +
            "位置信息：在您授权的情况下，我们可能会收集您的位置信息，以便为您提供更个性化的服务。\n" +
            "二、信息使用\n" +
            "我们收集的信息将用于提供、维护和改进应用服务，以及为您提供个性化的体验。\n" +
            "我们可能会使用您的信息进行数据分析，以了解用户行为和需求，从而提升应用的质量和性能。\n" +
            "三、信息共享与披露\n" +
            "我们不会将您的个人信息出售给第三方。但在某些情况下，我们可能会与合作伙伴共享您的信息，以提供特定的服务。\n" +
            "只有在法律要求或为保护我们的合法权益时，我们才会披露您的个人信息。\n" +
            "四、信息存储\n" +
            "我们将按照法律法规的要求，安全存储您的个人信息。在您不再使用本应用后，我们将根据相关规定删除或匿名化处理您的信息。\n" +
            "五、您的权利\n" +
            "您有权访问、更正、删除您的个人信息。\n" +
            "您可以随时撤回对某些信息收集的授权，但这可能会影响应用的部分功能。\n" +
            "六、更新与通知\n" +
            "我们可能会根据法律法规的变化或业务需求更新本隐私协议。更新后的协议将在应用内公布，您继续使用应用即视为同意最新的隐私协议。\n" +
            "如果您对本隐私协议有任何疑问或建议，请通过以下方式联系我们：[联系邮箱或电话]。";
}
